from enum import Enum


class CocoPart(Enum):
    Nose = 0 #코   19개
    Neck = 1 #목
    RShoulder = 2 #오른쪽 어깨
    RElbow = 3 #오른쪽 상박
    RWrist = 4 #오른쪽 하박
    LShoulder = 5 #왼쪽 어깨
    LElbow = 6 #왼쪽 상박
    LWrist = 7 #왼쪽 하박
    RHip = 8 #오른쪽 힙
    RKnee = 9 #오른쪽 다리
    RAnkle = 10 #오른쪽 발
    LHip = 11 #왼쪽 힙
    LKnee = 12 #왼쪽 다리
    LAnkle = 13 #왼쪽 발
    REye = 14 #오른쪽 눈
    LEye = 15 #왼쪽 눈
    REar = 16 #오른쪽 귀
    LEar = 17 #왼쪽 귀
    Background = 18 #백그라운드?

CocoPairs = [(1, 2),  #19개
             (1, 5),
             (2, 3),
             (3, 4),
             (5, 6),
             (6, 7),
             (1, 8),
             (8, 9),
             (9, 10),
             (1, 11),
             (11, 12),
             (12, 13),
             (1, 0),
             (0, 14),
             (14, 16),
             (0, 15),
             (15, 17),
             (2, 16),
             (5, 17)]   # = 19
CocoPairsRender = CocoPairs[:-2]


CocoPairsNetwork = [(12, 13),   #19개
                    (20, 21),
                    (14, 15),
                    (16, 17),
                    (22, 23),
                    (24, 25),
                    (0, 1),
                    (2, 3),
                    (4, 5),
                    (6, 7),
                    (8, 9),
                    (10, 11),
                    (28, 29),
                    (30, 31),
                    (34, 35),
                    (32, 33),
                    (36, 37),
                    (18, 19),
                    (26, 27)]  # = 19


CocoColors = [[0, 100, 255],  #1코        #연한파랑 18개
              [0, 100, 255],  #2목        #연한파랑
              [0, 255, 255],  #3오른팔상 #사인색
              [0, 100, 255],  #4연한파랑
              [255, 255, 255],  #5사인색
              [0, 100, 255],  #6연한파랑
              [0, 255, 0],  #7밝은그린색
              [255, 200, 100],  #8 살색
              [255, 0, 255],  #9 핫핑쿠
              [0, 255, 0],  #10밝은그린색
              [255, 200, 100],  #11살색
              [255, 0, 255],  #12핫핑쿠
              [255, 255, 255],  #13진한파랑
              [255, 0, 0],  #레드
              [200, 200, 0],  #황갈색
              [255, 0, 0],  #레드
              [200, 200, 0],  #황갈색
              [0, 0, 0]] #흰색


